mafeiGitHub/stm32Mp3/src/main.cpp
  //{{{
  bool load (int frame) {
  // return false if any load failed

    bool ok = true;

    mLoading = 0;
    int chunk;
    int seqNum = getSeqNumFromFrame (frame);

    if (!findSeqNumChunk (seqNum, mBitrate, 0, chunk)) {
      // load required chunk
      mLoading++;
      ok &= mChunks[chunk].load (mHttp, this, seqNum, mBitrate);
      }

    if (!findSeqNumChunk (seqNum, mBitrate, 1, chunk)) {
      // load chunk before
      mLoading++;
      ok &= mChunks[chunk].load (mHttp, this, seqNum+1, mBitrate);
      }

    if (!findSeqNumChunk (seqNum, mBitrate, -1, chunk)) {
      // load chunk after
      mLoading++;
      ok &= mChunks[chunk].load (mHttp, this, seqNum-1, mBitrate);
      }
    mLoading = 0;

    return ok;
    }
  //}}}

private:
  //{{{
  int getSeqNumFromFrame (int frame) {
  // works for -ve frame

    int r = frame - mBaseFrame;
    if (r >= 0)
      return getBaseSeqNum() + (r / getFramesPerChunk());
    else
      return getBaseSeqNum() - 1 - ((-r-1)/ getFramesPerChunk());
    }
  //}}}
  //{{{
  int getFrameInChunkFromFrame (int frame) {
  // works for -ve frame

    int r = (frame - mBaseFrame) % getFramesPerChunk();
    return r < 0 ? r + getFramesPerChunk() : r;
    }
  //}}}
  //{{{
  std::string getChunkNumStr (int chunk) {
    return mChunks[chunk].getSeqNum() ? toString (mChunks[chunk].getSeqNum() - getBaseSeqNum()) : "*";
    }
  //}}}

  //{{{
  bool findFrame (int frame, int& seqNum, int& chunk, int& frameInChunk) {
  // return true, seqNum, chunk and frameInChunk of loadedChunk from frame
  // - return false if not found

    auto findSeqNum = getSeqNumFromFrame (frame);
    for (auto i = 0; i < 3; i++) {
      if ((mChunks[i].getSeqNum() != 0) && (findSeqNum == mChunks[i].getSeqNum())) {
        auto findFrameInChunk = getFrameInChunkFromFrame (frame);
        if ((mChunks[i].getFramesLoaded() > 0) && (findFrameInChunk < mChunks[i].getFramesLoaded())) {
          seqNum = findSeqNum;
          chunk = i;
          frameInChunk = findFrameInChunk;
          return true;
          }
        }
      }

    seqNum = 0;
    chunk = 0;
    frameInChunk = 0;
    return false;
    }
  //}}}
  //{{{
  bool findSeqNumChunk (int seqNum, int bitrate, int offset, int& chunk) {
  // return true if match found
  // - if not, chunk = best reuse
  // - reuse same seqNum chunk if diff bitrate ?

    // look for matching chunk
    chunk = 0;
    while (chunk < 3) {
      if (seqNum + offset == mChunks[chunk].getSeqNum())
        return true;
        //return bitrate != mChunks[chunk].getBitrate();
      chunk++;
      }

    // look for stale chunk
    chunk = 0;
    while (chunk < 3) {
      if ((mChunks[chunk].getSeqNum() < seqNum-1) || (mChunks[chunk].getSeqNum() > seqNum+1))
        return false;
      chunk++;
      }

    chunk = 0;
    return false;
    }
  //}}}
  //{{{
  void invalidateChunks() {
    for (auto i = 0; i < 3; i++)
      mChunks[i].invalidate();
    }
  //}}}

  // private vars
  cHttp mHttp;
  cHlsChunk mChunks[3];
  int mBaseFrame = 0;
  int mBitrate = 0;
  int mLoading = 0;
  std::string mInfoStr;
  };
//}}}

//{{{  static vars
static USBD_HandleTypeDef USBD_Device;

static osSemaphoreId mAudSem;
static bool mAudHalf = false;

static float mVolume = 0.7f;
static int mIntVolume = 0;
static bool mVolumeChanged = false;

static int mPlayFrame = 0;

// ui
static cLcd* mLcd = nullptr;
static cRootContainer* mRoot = nullptr;

// mp3
static int fileIndex = 0;
static bool fileIndexChanged = false;
static std::vector<std::string> mMp3Files;

static bool mWaveLoad = false;
static bool mWaveChanged = false;
static int mWaveLoadFrame = 0;
static uint8_t* mWave = nullptr;
static int* mFrameOffsets = nullptr;

// hls
static int mTuneChan = 3;
static bool mTuneChanChanged = false;
static cHlsLoader* mHlsLoader;
static osSemaphoreId mHlsLoaderSem;
static std::string mInfoStr;
//}}}

//{{{  audio callbacks
//{{{
void BSP_AUDIO_OUT_HalfTransfer_CallBack() {
  mAudHalf = true;
  osSemaphoreRelease (mAudSem);
  }
//}}}
//{{{
void BSP_AUDIO_OUT_TransferComplete_CallBack() {
  mAudHalf = false;
  osSemaphoreRelease (mAudSem);
  }
//}}}
//}}}
//{{{
class cPowerWidget : public cWidget {
public:
  cPowerWidget (cHlsLoader* hlsLoader, float width, float height) : cWidget (COL_BLUE, width, height), mHlsLoader(hlsLoader) {}
  virtual ~cPowerWidget() {}

  virtual void render (iDraw* draw) {
    auto frame = mPlayFrame - mWidth/2;
    auto frames = 0;
    uint8_t* power;
    for (auto x = 0; x < mWidth; x++, frame++) {
      if (frames <= 0)
        power = mHlsLoader->getPower (frame, frames);
      if (power) {
        auto top = *power++;
        auto ylen = *power++;
        if (x < (mWidth/2) - 1)
          draw->rectClipped (COL_DARKBLUE, x, top, 1, ylen);
        else if (x == mWidth/2)
          draw->rectClipped (COL_DARKGREEN, x-1, top, 3, ylen);
        else if (x > (mWidth/2) + 1)
          draw->rectClipped (COL_DARKERGREY, x, top, 1, ylen);
        frames--;
        }
      }
    }
private:
  cHlsLoader* mHlsLoader;
  };
//}}}
//{{{
class cInfoTextBox : public cWidget {
public:
  cInfoTextBox (float width, float height) : cWidget(width, height) {}
  virtual ~cInfoTextBox() {}

  virtual void render (iDraw* draw) {
    draw->text (COL_WHITE, mHeight, mHlsLoader->getFrameStr (mPlayFrame).c_str(), mX, mY, mWidth, mHeight);
    }
  };
//}}}
//{{{
class cDotsBox : public cWidget {
public:
  cDotsBox() : cWidget(1.5f, 1.5f) {}
  virtual ~cDotsBox() {}

  virtual void render (iDraw* draw) {
    bool loaded;
    bool loading;

    mHlsLoader->getChunkLoad (0, loaded, loading);
    draw->ellipse (loading ? COL_DARKGREEN : loaded ? COL_DARKBLUE : COL_DARKRED,
                   mX + mWidth/2, mY + mHeight/4, (mWidth/4)-1, (mHeight/4)-1);

    mHlsLoader->getChunkLoad (1, loaded, loading);
    draw->ellipse (loading ? COL_DARKGREEN : loaded ? COL_DARKBLUE : COL_DARKRED,
                   mX + mWidth*3/4, mY + mHeight*3/4, (mWidth/4)-1, (mHeight/4)-1);

    mHlsLoader->getChunkLoad (2, loaded, loading);
    draw->ellipse (loading ? COL_DARKGREEN : loaded ? COL_DARKBLUE : COL_DARKRED,
                   mX + mWidth/4, mY + mHeight*3/4, (mWidth/4)-1, (mHeight/4)-1);
    }
  };
//}}}

